#include "delay.h"
#include"stdio.h"
#include "sys.h"
#include "lcd.h"
#include "touch.h"
#include "gui.h"
#include "test.h"
#include "INA226.h"
#include "myiic.h"
//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//测试硬件：单片机STM32F103RBT6,正点原子MiniSTM32开发板,主频72MHZ
//All rights reserved
//////////////////////////////////////////////////////////////////////////////////	
/****************************************************************************************************
//=======================================液晶屏数据线接线==========================================//
//CS		接PB12	//片选信号
//CLK	    接PB13	//SPI时钟信号
//SDI(DIN)	接PB15	//SPI总线数据信号
//=======================================液晶屏控制线接线==========================================//
//RS(D/C)   接PB1	//寄存器/数据选择信号(RS=0数据总线发送的是指令；RS=1数据总线发送的是像素数据)
/////////////////////////////////////////////////////////////////////////////////////////////////
//==================================如何精简到只需要3个IO=======================================//
//1.CS信号可以精简，不作SPI复用片选可将CS接地常低，节省1个IO
//2.LED背光控制信号可以接高电平3.3V背光常亮，节省1个IO
//3.RST复位信号可以接到单片机的复位端，利用系统上电复位，节省1个IO
//==================================如何切换横竖屏显示=======================================//
//打开lcd.h头文件，修改宏#define USE_HORIZONTAL 值为0使用竖屏模式.1,使用横屏模式
//===========================如何切换模拟SPI总线驱动和硬件SPI总线驱动=========================//
//打开lcd.h头文件，修改宏#define USE_HARDWARE_SPI  值为0使用模拟SPI总线.1,使用硬件SPI总线
**************************************************************************************************/	

int main(void)
{	
float Vol;	
//float C;	
float CA;	
//	NVIC_SystemReset(); // 复位
	SystemInit();//初始化RCC 设置系统主频为72MHZ
	delay_init(72);	     //延时初始化
	LCD_Init();	   //液晶屏初始化
	IIC_Init();		//初始化IIC
	INA226_Init();   //初始化INA226
	
	//LCD_Clear(BLACK); //清屏
	LCD_Clear(WHITE); //清屏
	//POINT_COLOR=WHITE; 
	POINT_COLOR=RED; 
	
	LCD_DrawRectangle(0,0,128-1,128-1);	//画矩形 

	Show_Str(32,5,BLACK,YELLOW,"系统监控",16,0);
	
	Show_Str(5,25,RED,RED,"温度     ℃",24,1);
	
	LCD_ShowNum2412(5+48,25,RED,YELLOW,":32",24,1);

	Show_Str(5,50,BLUE,RED,"湿度     ％",24,1);
	LCD_ShowNum2412(5+48,50,BLUE,RED,":38",24,1);

  Show_Str(5,75,RED,YELLOW,"电压      Ｖ",24,1);
	//Show_Str(5,75,GREEN,RED,"电压",24,0);
//	LCD_ShowNum2412(5+48+28,75,RED,RED,".",24,1);
	LCD_ShowNum2412(5+48,75,RED,YELLOW,":",24,1);	

  Show_Str(5,100,RED,YELLOW,"电流      Ａ",24,1);
	//Show_Str(5,100,GREEN,RED,"电流",24,0);
	LCD_ShowNum2412(5+48,100,RED,YELLOW,":",24,1);	  
	while(1)
	{
 //电压显示
		Vol = INA226_GetVoltage(INA226_ADDR1)*1.25f ; //mV

//		LCD_ShowNum(5+48+8,75,Vol,5,16);//显示mV
		LCD_ShowNum(5+48+8,80,Vol/1000,2,16);//显示整数部分
		LCD_ShowNum(5+48+28,80,(int)Vol/100%10,1,16);//显示第一位小数
		LCD_ShowNum(5+48+36,80,(int)Vol/10%10,1,16);//显示第二位小数	
		LCD_ShowNum(5+48+44,80,(int)Vol%10,1,16);//显示第三位小数
		Show_Str(5+48+24,80,RED,WHITE,".",16,1);//显示小数点
		
	//电流显示
	//	C = (INA226_GetShunt_Current(INA226_ADDR1)* 1.422f)*1000;
		CA = (INA226_GetShunt_Current(INA226_ADDR1)* 1.52f)*10;
		
	//	LCD_ShowNum(5+48+8,95,C,5,16);//显示mA
		LCD_ShowNum(5+48+8,105,CA/100,2,16);//显示整数部分
		LCD_ShowNum(5+48+28,105,(int)CA/100%10,1,16);//显示小数
		LCD_ShowNum(5+48+36,105,(int)CA/10%10,1,16);//显示小数
		LCD_ShowNum(5+48+44,105,(int)CA/1%10,1,16);//显示小数
		Show_Str(5+48+24,105,RED,WHITE,".",16,1);//显示小数点
		
	  delay_ms(1864);	// 
		NVIC_SystemReset(); // 复位
	};

}

